# Повторяем основные конструкции языка Python

"""
Реализуйте функцию hide_card(), которая принимает один аргумент:
card_number — строка, представляющая собой корректный номер банковской карты из 1616 цифр,
между которыми могут присутствовать символы пробела
Функция должна заменять первые 1212 цифр в строке card_number на символ * и возвращать полученный результат.
Если между цифрами в номере имелись символы пробела, их следует удалить.
"""
def hide_card(card_number):
    s = card_number.replace(' ', '')[-4:]
    new_s = '*' * 12 + s
    return new_s
