# 11.5 Регулярные выражения
""""""


"""   *   *   *   Task   *   *   *   """


#  11.05-1
"""
Написать регулярное выражение, которому соответствуют значение, удовлетворяющие следующим условиям:
- начинается с пяти цифр
- далее следует необязательная часть из четырех цифр, которая отделяется от пяти первых цифр дефисом
Input:  New postcode: ABCDE-8989, old postcode 0909-, 01928-0909
Output: 01928-0909
"""
regex = r'\d{5}(-\d{4})?'


#  11.05-2
"""
Североамериканские номера телефонов.
Регулярное выражение, которому соответствуют значение, удовлетворяющие следующим условиям:
- начинается с трех цифр, которые могут заключаться в круглые скобки
- далее через пробел или дефис следуют семь цифр, разделенный на трехцифровой префикс и четырехцифровой, 
между которыми указывается дефис.
В номере могут использоваться любые цифры за двумя исключениями: 
первая цифра кода города и первая цифра префикса не могут быть 0 или 1
Input:  Glados: 248-555-1234
Output: 248-555-1234
"""
regex = r'(([2-9]\d{2})|(\([2-9]\d{2}\)))' \
        r'[\s-]([2-9]\d{2})-\d{4}'


#  11.05-3
"""
- последовательность должна состоять только из bee и geek
- последовательность должна содержать хотя бы один geek
- bee не может находиться рядом с самим собой (не может быть beebee)
- geek может появиться только после того, как до этого было записано bee
- после каждого bee когда-нибудь должен появиться geek
Input:  Correct name is beegeekbeegeek
Output: beegeekbeegeek
"""
regex = r'beegeek(geek|beegeek)*'

# Вариант
regex = r'(bee(geek)+)+'


#  11.05-4
"""
https://stepik.org/lesson/684549/step/12?unit=683502
- первый символ — строчная латинская буква
- второй символ — цифра, любая буква в произвольном регистре или символ нижнего подчеркивания
- третий символ — заглавная латинская буква
- четвертый символ должен совпадать с первым символом
- пятый символ должен совпадать со вторым символом
- шестой символ должен совпадать с третьим символом
"""
regex = r'([a-z])(\w)([A-Z])\1\2\3'


#  11.05-5
"""
https://stepik.org/lesson/684549/step/13?unit=683502
Регулярное выражение, которому соответствуют строки, содержащие три или более последовательных повторений ok
"""
regex = r'(ok){3,}'

#  11.05-6
"""
https://stepik.org/lesson/684549/step/14?unit=683502
Регулярное выражение, которому соответствуют последовательности символов, 
представляющие собой девятисимвольные (9) палиндромы.
Input:  atri_c_irtjfien
Output: tri_c_irt
"""
regex = r'(.)(.)(.)(.).\4\3\2\1'


#  11.05-7
"""
https://stepik.org/lesson/684549/step/15?unit=683502
Регулярное выражение, которому соответствуют  слова, содержащие повторяющиеся буквы (БУКВЫ !!!).
Input:  Priveeeet my dear friend 
Output: Priveeeet
"""
regex = r'(?i)\w*([a-zа-яё])\w*\1\w*'

# Вариант проходит тесты, но ловит цифры и знак _
regex = r'\w*(\w)\w*\1+\w*'


#  11.05-8
"""
https://stepik.org/lesson/684549/step/16?unit=683502
регулярное выражение, которому соответствуют последовательности из 8 цифр. 
Причем последовательность может содержать символы дефиса - в качестве разделителей, 
только если они делят ее на группы по 2 цифры.
Input:  Digits from 0 to 7: 01234567 or 12-34-56-78
Output: 01234567 12-34-56-78
"""
regex = r'\d{2}(-?)(\d{2}\1){2}\d{2}'

# Вариант без ссылки назад
regex = r'\d{8}|(\d{2}-){3}\d{2}'


#  11.05-9
"""
https://stepik.org/lesson/684549/step/17?unit=683502
регулярное выражение, которому соответствуют последовательности из 8 цифр. 
- последовательность может содержать символы -, --- или . в качестве разделителей, 
  только если они делят ее на группы по 2 цифры
- последовательность должна содержать только один тип разделителя, если он присутствует  
Input:  Do you want to see? 11-22-33-44  or 12345678
Output: 11-22-33-44  12345678
"""
regex = r'\d{2}((-|---|\.)?)\d{2}\1\d{2}\1\d{2}'


#  11.05-10
"""
https://stepik.org/lesson/684549/step/18?unit=683502
регулярное выражение, которому соответствуют слова, записанные дважды подряд. 
Слова могут быть разделены одним или несколькими пробелами.
Input:  f fa fa
Output: fa fa
"""

# если вместо \b\1\b  оставить \1 то в тексте f fa fa --> F Fa fa
regex = r'(\b\w+\b)\s+\b\1\b'



