# 10.1 Итераторы. Часть 1
""""""


"""   *   *   *   Task   *   *   *   """


#  10.1-1
"""
Вывести четвертый элемент списка.
"""
numbers = [100, 70, 34, 45, 30, 83, 12, 83, -28, 49, -8, -2, 6, 62, 64, -22, -19, 61, 13, 5, 80, -17, 7, 3, 21, 73, 88,
           -11, 16, -22]

res = iter(numbers)
[next(res) for _ in range(3)]
print(next(res))


#  10.1-2
"""
Вывести последний элемент списка.
"""
numbers = [100, 70, 34, 45, 30, 83, 12, 83, -28, 49, -8, -2, 6, 62, 64, -22, -19, 61, 13, 5, 80, -17, 7, 3, 21, 73, 88,
           -11, 16, -22]
n = None
for el in iter(numbers):
    n = el
print(n)


# функция reversed создает итератор
res = reversed(numbers)
print(next(res))
