#  9.3 Функции высшего порядка map(), filter(). Анонимные функции lambda
""""""

"""
Анонимные функции  lambda
Общий формат определения анонимной функции: lambda список_параметров: выражение
список_параметров – список параметров через запятую, 
выражение – значение, либо код, дающий значение.
"""
f1 = lambda: 17                          # функция без параметров
f2 = lambda х, у: х ** 2 + у ** 2        # функция с двумя параметрами
f3 = lambda х, у, z: х * у * z           # функция с тремя параметрами

print(f1())             # 17
print(f2(6, 8))         # 100
print(f3(5, 10, 30))    # 1500

# Анонимные функции являются выражениями, то есть их можно сразу вызывать в момент определения.
print((lambda x, y: x + y)(10, 7))          # 17
print(eval('(lambda num: num ** 2)(7)'))    # 49


"""
Встроенная функция map() 
преобразует элементы переданного итерируемого объекта в соответствии с некоторой функцией 
и возвращает объект итератора.
Аргументы функции:
func — функция, которая вызывается для каждого элемента итерируемого объекта
iterable — итерируемый объект
Функция map() выполняет пользовательскую функцию func для каждого элемента последовательности iterable. 
Каждый элемент iterable отправляется в функцию func в качестве аргумента.
"""
squares = map(lambda x: x ** 2, range(1, 10))
print(*squares)  # 1 4 9 16 25 36 49 64 81


"""
Встроенная функция filter() 
фильтрует элементы переданного итерируемого объекта в соответствии с некоторой функцией 
и возвращает объект итератора.
Аргументы функции:
func — функция, которая принимает элемент последовательности и возвращает bool значение
iterable — итерируемый объект
Функция filter() фильтрует элементы переданного объекта iterable при помощи функции func. 
Если фильтрующая функция func вернёт False, 
то элемент последовательности iterable не попадёт в результирующий итератор.
"""
nums = [9, 3, 45, 67, 12, 90, 87, 12, 45, 67]
filter1 = filter(lambda x: x % 2 == 0, nums)
print(*filter1)  # 12 90 12


#  итераторы, которые возвращают функции map() и filter(), можно обойти только один раз

"""   *   *   *   Task   *   *   *   """

#  9.3-1
"""
Вывести все числа (тип int и float), находящиеся в data, отбрасывая дробную часть у вещественных чисел. 
Числа должны быть расположены в своем исходном порядке, каждое на отдельной строке.
"""
data = ['Timur', -16.648911695768902, 'six', -202, 883.0093275936454, -765, (3, 4), -105.10718000213546, 976,
        -308.96857946288094, 458, ['one', 'two'], 479.92207220345927, -87, -71, 'twelve', 112, -621, -715.0179551194733,
        'seven', 229, 729, -358, [1, 2, 3], -974, 882, -894.4709033242768, '', 323.7720806756133, 'beegeek', -224, 431,
        170.6353248658936, -343.0016746052049, 'number', 104.17133679352878, [], -353.5964777099863, 'zero', -113, 288,
        None, -708.3036176571618]


res = map(int, filter(lambda x: type(x) in (int, float), data))
[print(el) for el in res]

res = map(int, filter(lambda x: isinstance(x, (float, int)), data))
print(*res, sep='\n')

from math import trunc
res = map(trunc, filter(lambda x: type(x) in (int, float), data))
[print(el) for el in res]


#  9.3-2
"""
Вывести сумму квадратов всех двузначных чисел из данного списка, которые делятся на 9 без остатка.
"""
numbers = [4754, -4895, -364, -4764, 4683, 1639, -43, 228, -2701, -1503, 1223, 4340, -1296, 3939, -345, 623, -3275,
           1003, 4367, -1739, 550, -1217, -1334, 1526, -4359, -3028, -4663, 3356, 3887, 4297, -1982, 1013, 3299, 3556,
           -3324, 417, 3531, -3134, 1782, 4439, 1652, -985, 4327, 1517, 1225, -915, 2808, -3851, -1005, 3396, 2842,
           -3879, -3824, -3805, 1609, -4741, -3072, 3573, 4680, 588, -1430, 2378, -1095, -343, 4357, -2164, -3304, 4354,
           4926, -352, -1187, -3313, 2741, 4786, -2689, 741, 4558, 1442, 62, -1099, -2201, -16, -3115, 1862, 2384, 4072,
           -90, 204, 1158, -3134, -2512, 756, 4148, 4370, 1756, 3609, -1148, -3909, 4123, -2906, 69, 96, 1111]

res = sum(map(lambda x: x * x, filter(lambda x: 9 < abs(x) < 100 and x % 9 == 0, numbers)))
print(res)


#  9.3-3
"""
Вывести все имена, которые начинаются на буквы А и М (независимо от регистра) и имеют длину больше 4. 
Имена должны быть расположены в лексикографическом порядке, через пробел, каждое с заглавной буквы.
Input:  names
Output: Аделина Айлин Александр ...
"""
names = ['ульяна', 'арина', 'Дмитрий', 'Сергей', 'Яна', 'мила', 'Ольга', 'софья', 'семён', 'Никита', 'маргарита',
         'Василиса', 'Кирилл', 'александр', 'александра', 'Иван', 'андрей', 'Родион', 'максим', 'алиса', 'Артём',
         'софия', 'владимир', 'дамир', 'Валерий', 'степан', 'Алексей', 'Марк', 'олег', 'ирина', 'Милана', 'мия',
         'денис', 'Фёдор', 'Елизавета', 'айлин', 'Варвара', 'валерия', 'Алёна', 'Николь', 'юлия', 'Ксения', 'пётр',
         'георгий', 'Мария', 'глеб', 'илья', 'Захар', 'Дарья', 'Евгения', 'матвей', 'Серафим', 'екатерина', 'Тимофей',
         'виктор', 'Егор', 'Ника', 'анна', 'даниил', 'тихон', 'вера', 'кира', 'Эмилия', 'Виктория', 'Игорь', 'полина',
         'алина', 'Давид', 'анастасия', 'Вероника', 'ярослав', 'Руслан', 'татьяна', 'Демид', 'амелия', 'Элина', 'Арсен',
         'евгений', 'мадина', 'дарина', 'Савелий', 'Платон', 'Аделина', 'диана', 'Айша', 'павел', 'Стефания', 'Тимур',
         'Ева', 'Елисей', 'Артемий', 'григорий', 'Мирон', 'Мирослава', 'Мира', 'Марат', 'Лилия', 'роман', 'владислав',
         'Леонид']

res = map(str.title, filter(lambda x: x[0] in 'АМам' and len(x) > 4, names))
print(*sorted(res))

# Короче
print(*sorted(map(str.title, filter(lambda x: x[0] in 'АМам' and len(x) > 4, names))))


#  9.3-4
"""
Используя синтаксис анонимных функций, реализуйте рекурсивную функцию fib(), которая принимает один аргумент:
n — натуральное число
Функция должна возвращать n-ый член последовательности Фибоначчи.
Input:  print(fib(8))
Output: 21
"""
fib = lambda x: 1 if x <= 2 else fib(x - 1) + fib(x - 2)

# мемоизация
# https://docs-python.ru/standart-library/modul-functools-python/dekorator-lru-cache-modulja-functools/
from functools import lru_cache
fib = lru_cache()(lambda x: 1 if x <= 2 else fib(x - 1) + fib(x - 2))

print(fib(100))  # 354224848179261915075


#  9.3-5
"""
Реализуйте функцию print_operation_table(), которая принимает три аргумента в следующем порядке:
operation — функция, характеризующая некоторую бинарную операцию
rows — натуральное число
cols — натуральное число
Функция должна составлять и выводить таблицу из rows строк и cols столбцов, 
в которой элемент со строкой 𝑛 и столбцом 𝑚 имеет значение operation(n, m)
Примечание 1. Нумерация строк и столбцов в таблице начинается с единицы.
Примечание 2. Элементы в строках таблицы должны быть разделены одним пробелом (выравнивать таблицу необязательно)

Input:  print_operation_table(lambda a, b: a * b, 5, 5)
Output: 1   2   3   4   5
        2   4   6   8   10
        3   6   9   12  15
        4   8   12  16  20
        5   10  15  20  25
"""
def print_operation_table(oper, rows, cols):
    width = len(str(oper(rows, cols)))
    for row in range(1, rows + 1):
        for col in range(1, cols + 1):
            print(f'{oper(row, col)}'.ljust(width), end=' ')
        print()

# print_operation_table(lambda a, b: a * b, 5, 5)
# print_operation_table(pow, 5, 3)


#  9.3-6
"""
Функция verification()
https://stepik.org/lesson/640036/step/18?unit=636556
Реализуйте функцию verification(), которая проверяет правильность введенного пароля. 
Она должна принимать четыре аргумента в следующем порядке:

login — логин пользователя
password — пароль пользователя
success — некоторая функция
failure — некоторая функция

Пароль считается правильным, если в нем присутствует, 
хотя бы одна заглавная латинская буква, 
хотя бы одна строчная латинская буква и хотя бы одна цифра. 

Функция verification() должна вызывать функцию success() с аргументом login, 
если переданный пароль является правильным, 
иначе — функцию failure() с аргументами login и строкой-сообщением об ошибке:

в пароле нет ни одной буквы, если в пароле отсутствуют латинские буквы
в пароле нет ни одной заглавной буквы, если в пароле отсутствуют заглавные латинские буквы
в пароле нет ни одной строчной буквы, если в пароле отсутствуют строчные латинские буквы
в пароле нет ни одной цифры, если в пароле отсутствуют цифры
"""
from string import ascii_letters

def verification(login, password, success, failure):
    message = ['буквы', 'заглавной буквы', 'строчной буквы', 'цифры']
    latin = ''.join(filter(lambda x: x in ascii_letters, password))
    res = [len(latin),
           any(map(str.isupper, latin)),
           any(map(str.islower, latin)),
           any(map(str.isdigit, password))]

    if all(res):
        success(login)
    else:
        text = f'в пароле нет ни одной {message[res.index(False)]}'
        failure(login, text)
